import time
import hmac
import requests


ACCESS_KEY = "LS8A9EF19641FBB5CD8AB7EFE25F1A75"  # 替换成九方提供的ACCESS_KEY
SECRET_KEY = "LS43BC3EB36C233CD24A607A3FECAB18"  # 替换成九方提供的SECRET_KEY


def create_sign(now, access_key, secret_key):
    """
    采用Md5加密并固定盐值salt为SecretKey
    待加密字符串包含access_key 和 timestamp
    """
    str_query = f"access_key={access_key}&timestamp={now}"
    sign = hmac.new(secret_key.encode(), str_query.encode(),
                    digestmod='MD5').hexdigest()
    return sign.upper()


def gen_baoxue():
    p = ["中国", "内地", "大陆","华北", "华南", "华中", "中部", "北部", "南部", "西部", "东部", "沿海地区", "大山", "平原", "地区", "乡镇", "县城", "地级市", "都市", "国外", "北京", "上海", "重庆", "天津", "河北",
         "山西", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "海南", "四川", "贵州", "云南", "陕西", "甘肃", "青海", "台湾"]

    key = ["暴雪", "寒潮", "大雪", "暴雪", "低温", "寒潮", "霜冻", "暴风雪", "冰雹", "雪灾"]
    sub_key = ["", "天候", "气候", "天气", "预警", "预告", "黄色预警", "红色预警"]

    q_list = ""
    for i in p:
        for j in key:
            for s in sub_key:
                q_list += i+j+s+","
    return q_list[:-1]


def gen_baoyu():
    p = ["中国", "内地","华北","华南", "华中",  "大陆", "中部", "北部", "南部", "西部", "东部", "沿海地区", "大山", "平原", "地区", "乡镇", "县城", "地级市", "都市", "国外", "北京", "上海", "重庆", "天津", "河北",
         "山西", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "海南", "四川", "贵州", "云南", "陕西", "甘肃", "青海", "台湾"]

    key = ["暴雨","洪涝","大雨","强降雨","暴雨"]
    sub_key = ["", "天候", "气候", "天气", "预警", "预告", "黄色预警", "红色预警"]

    q_list = ""
    for i in p:
        for j in key:
            for s in sub_key:
                q_list += i+j+s+","
    return q_list[:-1]

def gen_ganhan():
    p = ["中国", "西南", "华北","华南", "华中","内地", "大陆", "中部", "北部", "南部", "西部", "东部", "沿海地区", "大山", "平原", "地区", "乡镇", "县城", "地级市", "都市", "国外", "北京", "上海", "重庆", "天津", "河北",
         "山西", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "海南", "四川", "贵州", "云南", "陕西", "甘肃", "青海", "台湾"]

    key = ["水资源","水资源保护","水污染","碳水危机","洪水","人水关系","水情","水旱","水资源管理","净水","调水","节水","水资源分配","雨水"] 
    # 1.地理教育 2.地理研学
    sub_key = [""]
    # sub_key = ["", "天候", "气候", "天气", "预警", "预告", "黄色预警", "红色预警"]
    # sub_key = ["","政策","环境","现状","情势","危机","可持续利用"]

    q_list = ""
    for i in p:
        for j in key:
            for s in sub_key:
                # q_list = i+j+s+"," + q_list
                q_list += i+j+s+","
    return q_list[:-1]


if __name__ == '__main__':
    # gen_baoxue()
    print(gen_ganhan())
    
